W4D1/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Learning Routes"], ["author", "Lu Fan"], ["created_at", "2017-12-24 07:06:24.205245"], ["updated_at", "2017-12-24 07:06:24.205245"]]
---
  def create
    new_book = Book.new(book_params)
    if new_book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
---
  def destroy
    book_delete = Book.find_by(id: params[:id])
    book_delete.delete